Optimization/optimization.org
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{esint}
#+LATEX_HEADER:\usepackage[english,russian]{babel}
#+LATEX_HEADER:\usepackage{mathtools}
#+LATEX_HEADER:\usepackage{amsthm}
#+OPTIONS: toc:nil
#+LATEX_HEADER:\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}

#+LATEX_HEADER:\def\zall{\setcounter{lem}{0}\setcounter{cnsqnc}{0}\setcounter{th}{0}\setcounter{Cmt}{0}\setcounter{equation}{0}\setcounter{stnmt}{0}}

#+LATEX_HEADER:\newcounter{lem}\setcounter{lem}{0}
#+LATEX_HEADER:\def\lm{\par\smallskip\refstepcounter{lem}\textbf{\arabic{lem}}}
#+LATEX_HEADER:\newtheorem*{Lemma}{Лемма \lm}

#+LATEX_HEADER:\newcounter{th}\setcounter{th}{0}
#+LATEX_HEADER:\def\th{\par\smallskip\refstepcounter{th}\textbf{\arabic{th}}}
#+LATEX_HEADER:\newtheorem*{Theorem}{Теорема \th}

#+LATEX_HEADER:\newcounter{cnsqnc}\setcounter{cnsqnc}{0}
#+LATEX_HEADER:\def\cnsqnc{\par\smallskip\refstepcounter{cnsqnc}\textbf{\arabic{cnsqnc}}}
#+LATEX_HEADER:\newtheorem*{Consequence}{Следствие \cnsqnc}

#+LATEX_HEADER:\newcounter{Cmt}\setcounter{Cmt}{0}
#+LATEX_HEADER:\def\cmt{\par\smallskip\refstepcounter{Cmt}\textbf{\arabic{Cmt}}}
#+LATEX_HEADER:\newtheorem*{Note}{Замечание \cmt}

#+LATEX_HEADER:\newcounter{stnmt}\setcounter{stnmt}{0}
#+LATEX_HEADER:\def\st{\par\smallskip\refstepcounter{stnmt}\textbf{\arabic{stnmt}}}
#+LATEX_HEADER:\newtheorem*{Statement}{Утверждение \st}

* Структура курса
+ Введение в теорию сложности
+ Линейное программирование
+ Методы непрерывной оптимизации
+ Методы решения переборных задач
* Литература
1. Новикова Н. М. "Дискретные и непрерывные задачи оптимизации"
2. М. Гэри, Д. Джонсон "Вычислительные машины и труднорешаемые задачи"
3. Х. Пападимитриу, К. Стайглиц "Комбинаторные оптимизации"
4. http://www.ccas.ru/depart/malashen/53kmsu.htm
* Введение в теорию сложности
#+begin_export latex
\textbf{Массовая задача} $\Pi = \{I\}$, где $I$ - \textbf{индивидуальная задача}. Массовая задача определяется:
\begin{enumerate}
\item списком параметров
\item требованиями к решению
\end{enumerate}
#+end_export
** Задача коммивояжёра
Задан взвешенный ориентированный граф: вершины и матрицы. Нужно найти маршрут через все
вершины графа минимального веса.
#+begin_export latex
\begin{equation*}
\text{Найти } \pi^0\{1, \ldots, n\} \rightarrow \pi(1), \ldots, \pi(n), \\
\pi^0 \in \operatorname{Arg}\min_{\pi}\left\{\sum_{i = 1}^{n - 1}d(C_{\pi_i}, C_{\pi_{i + 1}}) + d(C_{\pi_n}, C_{\pi_1}))\right\}
\end{equation*}
#+end_export
Всего порядка $n!$ маршрутов.

Задача *бездомного* коммивояжёра - нужно найти гамильтонов путь в графе. Эта задача имеет ту
же сложность.

Задача построения *остовного дерева* минимального веса.

С точки зрения сложности задачи делятся на два класса: полиномиальная или экспоненциальная
зависимость затрат на решения от длины входа.
** Задачи распознавания свойств
Задачи, в которых требования к решению выражаются предикатом. В этих терминах задача коммивояжёра
формулируется так:
#+begin_export latex
\begin{equation*}
\{n, \{d_{ij} = d(c_i, c_j)\}, B\}
\end{equation*}
\begin{equation*}
\exists? \pi: \left\{\operatorname{Arg}\min_{\pi}\left\{\sum_{i = 1}^{n - 1}d(C_{\pi_i}, C_{\pi_{i + 1}}) + d(C_{\pi_n}, C_{\pi_1})\right\}\right\} \leq B
\end{equation*}
#+end_export
С помощью бинарного поиска задача распознавания свойств сводится к оптимизационной задаче,
класс задачи при этом не меняется.
*Кодировка* массовой задачи $\Pi$ включает в себя:
1. Алфавит $\Sigma$ - конечное множество символов.
2. $\Sigma^*$ - множество слов в алфавите $\Sigma$. Длину слова $\sigma$ будем обозначать $|\sigma|$.
3. *Функция кодирования* $e: \{I\} \Rightarrow \Sigma^*, e(I) = \sigma$, обладающая свойствами:
   + Инъективность(однозначность): $\forall I_1 \neq I_2 e(I_1) \neq e(I_2)$.
   + Полиноминальность кодирования и декодирования: $\exists p(\cdot)\text{( --- полином )} \forall I \in \Pi: |e(I)| \leq p(|I|), |e^{-1}(\sigma)| \leq p(|\sigma|)$
   + Неизбыточность: $\forall e'$, обладающей предыдущими двумя свойствами $\exists p(\cdot): |e(I)| \leq p(|e'(I)|)$ на наборе задач, для которого $\forall m \exists I |e(I)| \leq m$.
** Задача 1
Задача построения остовного дерева минимального веса(+задача распознавания свойства):
#+begin_export latex
\begin{equation*}
n, d_{ij} \in \mathbb{N}_0
\end{equation*}
#+end_export
Предложить неизбыточную кодировку входа, найти длину входа и сравнить её с оценкой для задачи
коммивояжёра:
#+begin_export latex
\begin{equation*}
n + \lceil\log_2B\rceil + \max_{ij}\lceil\log_2d_{ij}\rceil
\end{equation*}
#+end_export
** Язык задачи
Помимо кодировки с задачей связывается *язык*: $\alpha(\Pi, e) = \{\sigma \in \Sigma^* | \sigma = e(I), I \in Y(\Pi)\}$,
где $Y(\Pi)$ -- это множество индивидуальных задач, на которых ответ является истиной.

Алгоритм - программа для ДМТ, по кодировке задачи выдающая ответ. Алгоритм $A$ *применим* к $\sigma \in \Sigma^*$,
если на этом слове он останавливается. Алгоритм $A$ *принимает* слово $\sigma$, если он
останавливается на нём и выдаёт истинный ответ.
#+begin_export latex
\begin{equation*}
\alpha(A) = \{\sigma \in \Sigma^* | \Sigma \text{-- алфавит } A, A(\sigma) = true\}
\end{equation*}
#+end_export
Алгоритм A *решает* задачу $\Pi$ с кодировкой $e$, если $\forall \sigma \in \Sigma^* A$
останавливается и $\alpha(A) = \alpha(\Pi, e)$.

*Функция временной сложности* алгоритма $A$ решения $\Pi$ называется функция $T_A(\cdot)$, обладающая
свойствами:
1. $\forall I \in \Pi$ введём $t_A(\sigma), \sigma = e(I)$ - *время до остановки* алгоритма $A$ на входе $I$ (в числе шагов ДМТ).
2. $\forall m \in \mathbb{N}: T_A(m) = \max_{\sigma \in \Sigma^*, |\sigma| \leq m}t_A(\sigma)$

Класс $\mathbb{P}$ - класс *полиномиально разрешимых* задач:
#+begin_export latex
\begin{equation*}
\mathbb{P} = \{\alpha(\Pi, e) | \exists A \text{ -- алгоритм, решающий } \Pi \text{ с кодировкой } e:
\exists p(\cdot) \text{ -- полином}: T_A(\cdot) \leq p(.)\}
\end{equation*}
#+end_export
*Замечание*: это определение относится только к задачам распознавания свойств.
** Задача 2
Предложить алгоритм распознавания простоты числа, найти его функцию временной сложности и
оценить её.
