Optimization/optimization.tex
% Created 2020-03-05 Thu 15:24
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{amsmath}
\usepackage{esint}
\usepackage[english, russian]{babel}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}
\def\zall{\setcounter{lem}{0}\setcounter{cnsqnc}{0}\setcounter{th}{0}\setcounter{Cmt}{0}\setcounter{equation}{0}\setcounter{stnmt}{0}}
\newcounter{lem}\setcounter{lem}{0}
\def\lm{\par\smallskip\refstepcounter{lem}\textbf{\arabic{lem}}}
\newtheorem*{Lemma}{Лемма \lm}
\newcounter{th}\setcounter{th}{0}
\def\th{\par\smallskip\refstepcounter{th}\textbf{\arabic{th}}}
\newtheorem*{Theorem}{Теорема \th}
\newcounter{cnsqnc}\setcounter{cnsqnc}{0}
\def\cnsqnc{\par\smallskip\refstepcounter{cnsqnc}\textbf{\arabic{cnsqnc}}}
\newtheorem*{Consequence}{Следствие \cnsqnc}
\newcounter{Cmt}\setcounter{Cmt}{0}
\def\cmt{\par\smallskip\refstepcounter{Cmt}\textbf{\arabic{Cmt}}}
\newtheorem*{Note}{Замечание \cmt}
\newcounter{stnmt}\setcounter{stnmt}{0}
\def\st{\par\smallskip\refstepcounter{stnmt}\textbf{\arabic{stnmt}}}
\newtheorem*{Statement}{Утверждение \st}
\author{Sergey Makarov}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Sergey Makarov},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}


\section{Структура курса}
\label{sec:orgba99d8f}
\begin{itemize}
\item Введение в теорию сложности
\item Линейное программирование
\item Методы непрерывной оптимизации
\item Методы решения переборных задач
\end{itemize}
\section{Литература}
\label{sec:orgaea3125}
\begin{enumerate}
\item Новикова Н. М. "Дискретные и непрерывные задачи оптимизации"
\item М. Гэри, Д. Джонсон "Вычислительные машины и труднорешаемые задачи"
\item Х. Пападимитриу, К. Стайглиц "Комбинаторные оптимизации"
\item \url{http://www.ccas.ru/depart/malashen/53kmsu.htm}
\end{enumerate}
\section{Введение в теорию сложности}
\label{sec:org21a760b}
\textbf{Массовая задача} $\Pi = \{I\}$, где $I$ - \textbf{индивидуальная задача}. Массовая задача определяется:
\begin{enumerate}
\item списком параметров
\item требованиями к решению
\end{enumerate}
\subsection{Задача коммивояжёра}
\label{sec:org9cd92ef}
Задан взвешенный ориентированный граф: вершины и матрицы. Нужно найти маршрут через все
вершины графа минимального веса.
\begin{equation*}
\text{Найти } \pi^0\{1, \ldots, n\} \rightarrow \pi(1), \ldots, \pi(n), \\
\pi^0 \in \operatorname{Arg}\min_{\pi}\left\{\sum_{i = 1}^{n - 1}d(C_{\pi_i}, C_{\pi_{i + 1}}) + d(C_{\pi_n}, C_{\pi_1}))\right\}
\end{equation*}
Всего порядка \(n!\) маршрутов.

Задача \textbf{бездомного} коммивояжёра - нужно найти гамильтонов путь в графе. Эта задача имеет ту
же сложность.

Задача построения \textbf{остовного дерева} минимального веса.

С точки зрения сложности задачи делятся на два класса: полиномиальная или экспоненциальная
зависимость затрат на решения от длины входа.
\subsection{Задачи распознавания свойств}
\label{sec:orgd8e565b}
Задачи, в которых требования к решению выражаются предикатом. В этих терминах задача коммивояжёра
формулируется так:
\begin{equation*}
\{n, \{d_{ij} = d(c_i, c_j)\}, B\}
\end{equation*}
\begin{equation*}
\exists? \pi: \left\{\operatorname{Arg}\min_{\pi}\left\{\sum_{i = 1}^{n - 1}d(C_{\pi_i}, C_{\pi_{i + 1}}) + d(C_{\pi_n}, C_{\pi_1})\right\}\right\} \leq B
\end{equation*}
С помощью бинарного поиска задача распознавания свойств сводится к оптимизационной задаче,
класс задачи при этом не меняется.
\textbf{Кодировка} массовой задачи \(\Pi\) включает в себя:
\begin{enumerate}
\item Алфавит \(\Sigma\) - конечное множество символов.
\item \(\Sigma^*\) - множество слов в алфавите \(\Sigma\). Длину слова \(\sigma\) будем обозначать \(|\sigma|\).
\item \textbf{Функция кодирования} \(e: \{I\} \Rightarrow \Sigma^*, e(I) = \sigma\), обладающая свойствами:
\begin{itemize}
\item Инъективность(однозначность): \(\forall I_1 \neq I_2 e(I_1) \neq e(I_2)\).
\item Полиноминальность кодирования и декодирования: \(\exists p(\cdot)\text{( --- полином )} \forall I \in \Pi: |e(I)| \leq p(|I|), |e^{-1}(\sigma)| \leq p(|\sigma|)\)
\item Неизбыточность: \(\forall e'\), обладающей предыдущими двумя свойствами \(\exists p(\cdot): |e(I)| \leq p(|e'(I)|)\) на наборе задач, для которого \(\forall m \exists I |e(I)| \leq m\).
\end{itemize}
\end{enumerate}
\subsection{Задача 1}
\label{sec:org824e70f}
Задача построения остовного дерева минимального веса(+задача распознавания свойства):
\begin{equation*}
n, d_{ij} \in \mathbb{N}_0
\end{equation*}
Предложить неизбыточную кодировку входа, найти длину входа и сравнить её с оценкой для задачи
коммивояжёра:
\begin{equation*}
n + \lceil\log_2B\rceil + \max_{ij}\lceil\log_2d_{ij}\rceil
\end{equation*}
\subsection{Язык задачи}
\label{sec:org673fb77}
Помимо кодировки с задачей связывается \textbf{язык}: \(\alpha(\Pi, e) = \{\sigma \in \Sigma^* | \sigma = e(I), I \in Y(\Pi)\}\),
где \(Y(\Pi)\) -- это множество индивидуальных задач, на которых ответ является истиной.

Алгоритм - программа для ДМТ, по кодировке задачи выдающая ответ. Алгоритм \(A\) \textbf{применим} к \(\sigma \in \Sigma^*\),
если на этом слове он останавливается. Алгоритм \(A\) \textbf{принимает} слово \(\sigma\), если он
останавливается на нём и выдаёт истинный ответ.
\begin{equation*}
\alpha(A) = \{\sigma \in \Sigma^* | \Sigma \text{-- алфавит } A, A(\sigma) = true\}
\end{equation*}
Алгоритм A \textbf{решает} задачу \(\Pi\) с кодировкой \(e\), если \(\forall \sigma \in \Sigma^* A\)
останавливается и \(\alpha(A) = \alpha(\Pi, e)\).

\textbf{Функция временной сложности} алгоритма \(A\) решения \(\Pi\) называется функция \(T_A(\cdot)\), обладающая
свойствами:
\begin{enumerate}
\item \(\forall I \in \Pi\) введём \(t_A(\sigma), \sigma = e(I)\) - \textbf{время до остановки} алгоритма \(A\) на входе \(I\) (в числе шагов ДМТ).
\item \(\forall m \in \mathbb{N}: T_A(m) = \max_{\sigma \in \Sigma^*, |\sigma| \leq m}t_A(\sigma)\)
\end{enumerate}

Класс \(\mathbb{P}\) - класс \textbf{полиномиально разрешимых} задач:
\begin{equation*}
\mathbb{P} = \{\alpha(\Pi, e) | \exists A \text{ -- алгоритм, решающий } \Pi \text{ с кодировкой } e:
\exists p(\cdot) \text{ -- полином}: T_A(\cdot) \leq p(.)\}
\end{equation*}
\textbf{Замечание}: это определение относится только к задачам распознавания свойств.
\subsection{Задача 2}
\label{sec:org2309948}
Предложить алгоритм распознавания простоты числа, найти его функцию временной сложности и
оценить её.
