Optimization/optimization.tex
\subsection{Самая интересная часть}
\label{sec:orgbd984e8}
Алгоритмически неразрешимая задача(Матиясевич): по коэффициентам многочлена проверить у него
наличие целочисленных корней.

\textbf{НМТ} \(\hat{A} = \{A_s\}_{s \in \Sigma^*}\), где \(A_s\) - ДМТ с алфавитом \(\Sigma\).
\(A(\sigma)\) останавливается тогда, когда останавливается первая из них, принимающая \(\sigma\).
Множество слов, принимаемых НМТ, совпадает с множеством слов, на которых она применима.

\textbf{Функция временной сложности} НМТ \(\hat{A}\) решения \(\Pi\) -- функция \(\hat{T}_{\hat A}(\cdot)\), для которой:
\begin{enumerate}
\item \(\forall I \in \Pi\) вводим \textbf{время до остановки} \(t_{\hat{A}}(\sigma), \sigma = e(I)\) -- время до
\end{enumerate}
остановки первой из ДМТ плюс время прочтения её идентификатора: \(t_{\hat{A}} = t_{A_s}(\sigma) + |s|\).
\begin{enumerate}
\item \(\forall m \in \mathbb{N}: T_{\hat{A}}(m) = \max_{\sigma \in \alpha(\Pi, e): |\sigma| \leq m}\inf_{s: \sigma \in \alpha(A_s)}(t_{A_s}(\sigma) + |s|)\)
\end{enumerate}

Класс \(\mathbb{NP}\) - класс \textbf{недетерминированно полиномиально разрешимых} задач:
\begin{equation*}
\mathbb{NP} = \{\alpha(\Pi, e) | \exists \hat{A} \text{ -- НМТ, решающая } \Pi \text{ с кодировкой } e:
\exists p(\cdot) \text{ -- полином}: \hat{T}_{\hat{A}}(\cdot) \leq p(.)\}
\end{equation*}
\textbf{Замечание}: как и предыдущее определение, это определение применимо только к задачам
распознавания свойств.
\begin{Statement}
\begin{equation*}
\mathbb{P} \subseteq \mathbb{NP}
\end{equation*}
\end{Statement}
Пусть \(\Pi\) - массовая задача распознавания свойств. Задача \(\overline{\Pi}\) называется
\textbf{дополнительной} задачей к \(\Pi\), если \(Y(\overline{\Pi}) = D(\Pi) \backslash Y(\Pi)\).
Класс co-\(\mathbb{P} = \{\overline{\Pi} | \Pi \in \mathbb{P}\}\).
Класс co-\(\mathbb{NP} = \{\overline{\Pi} | \Pi \in \mathbb{NP}\}\).
\begin{Statement}
\begin{equation*}
\text{co-}\mathbb{P} = \mathbb{P}
\end{equation*}
\end{Statement}
Задача \(\Pi\) имеет \textbf{хорошую характеризацию}, если \(\Pi \in \mathbb{NP} \cap \textit{co-}\mathbb{NP}\)
(в частности, \(\mathbb{P} \subseteq \mathbb{NP} \cap \textit{co-}\mathbb{NP}\)).

Рассмотрим все задачи \(\Pi \in \mathbb{NP}\) и введём на нём иерархию задач.
Будем говорить, что \(\Pi_1 \propto \Pi_2\)(\(\Pi_1\) \textbf{полиномиально сводится} к \(\Pi_2\)), если
\(\exists f: \forall I_1 \in \Pi_1, e_1(I_1)\overset{f}{\rightarrow}e_2(I_2): I_1 \in Y(\Pi_1) \Leftrightarrow f(e_1(I_1)) \in Y(\Pi_2), \exists \text{ ДМТ, реализующая } f: \exists p(\cdot): T_{A_f} \leq p(\cdot)\).
В этом случае задача \(\Pi_1\) не сложнее задачи \(\Pi_2\).
\begin{Statement}
Если $\Pi_1 \propto \Pi_2$ и $\Pi_2 \in \mathbb{P}$, то $\Pi_1 \in \mathbb{P}$.
\end{Statement}
\begin{proof}
Если $\Pi_2 \in \mathbb{P}$, то $\exists p_2(\cdot): T_{A_2} \leq p_2(\cdot)$. Тогда для
алгоритма $A_1 = A_2 \circ f \exists p_1(\cdot) = p_2(p_f(\cdot)): T_{A_1} \leq p_1(\cdot)$.
\end{proof}
\begin{Statement}
Если $\Pi_1 \propto \Pi_2$ и $\Pi_2 \in \mathbb{NP}$, то $\Pi_1 \in \mathbb{NP}$.
\end{Statement}
\begin{proof}
Доказательство аналогично предыдущему утверждению.
\end{proof}
Класс \textbf{NP-полных задач}: \(\mathbb{NPC} = \{\Pi \in \mathbb{P} \forall \Pi' \in \mathbb{NP}: \Pi' \propto \Pi\}\).

\textbf{Задача выполнимости}: проверить существование набора \(z\) на котором некоторая формула,
представленная в КНФ, обращается в 1.
\begin{Theorem}[Теорема Кука]
$\mathbb{NPC} \neq \emptyset$: задача выполнимости NP-полна.
\end{Theorem}
\begin{proof}
Покажем, что эта задача принадлежит классу $\mathbb{NP}$. Проверка решения -- подстановка
набора в формулу -- полиномиальна. Формулировку любой задачи класса из $\mathbb{NP}$ можно
записать в виде булева предиката, что и будет сведением этой задачи к задаче SAT.
\end{proof}
\begin{Statement}
\begin{equation*}
\Pi_1 \propto \Pi_2, \Pi_2 \propto \Pi_3 \Rightarrow \Pi_1 \propto \Pi_3
\end{equation*}
\end{Statement}
\begin{proof}
Утверждение следует из того, что суперпозиция полиномов - полином.
\end{proof}
\begin{Statement}
\begin{enumerate}
\item Если $\exists \Pi \in \mathbb{NPC}: \Pi \in \mathbb{P}$, то $\mathbb{P} = \mathbb{NP}$.
\item Если для некоторой $\Pi \in \mathbb{NPC}: \Pi \notin \mathbb{P}$, то $\mathbb{NPC} \subseteq \mathbb{NP} \backslash \mathbb{P}$.
\end{enumerate}
\end{Statement}
\begin{Statement}
Если для некоторой NP-полной задачи $\overline{P} \in \mathbb{NPC}$,
то $\mathbb{NPC} = \text{co-}\mathbb{NPC}$.
\end{Statement}
\begin{proof}
Пусть $\Pi' \in \mathbb{NP}: \overline{\Pi'} \propto \overline{P}, \overline{\Pi} \in \mathbb{NP}$,
поэтому $\overline{\Pi'}$ поэтому $\textit{co-}NPC \subseteq \mathbb{NPC}, \mathbb{NPC} \subseteq \textit{co-}\mathbb{NPC}$.
\end{proof}
Для задачи co-SAT нельзя ли в качестве подсказки дать дизъюнкцию, всегда обращающуся в ноль?
\begin{Statement}
Если $\Pi' \in \mathbb{NP}$ и $\exists \Pi \in \mathbb{NPC}: \Pi \propto \Pi'$, то
$\Pi' \in \mathbb{NPC}$.
\end{Statement}
\begin{proof}
Это следует из транзитивности полиномиальной сводимости.
\end{proof}
Задача \textbf{булево линейное неравенство}:\\
Пусть $A \in \mathbb{R}^{n\times n}, b \in \mathbb{R}^{1\times n}$. Существует ли
$z \in \mathbb{B}^n:$
\begin{equation}
Az \preceq b?
\end{equation}
\begin{Statement}
Задача "булево линейное неравенство" NP-полна.
\end{Statement}
\begin{proof}
Эта задача принадлежит классу $\mathbb{NP}$, так как проверка решения выполняется за линейное
время.

Задача SAT сводится к задаче на линейное неравенство, откуда следует NP-полнота этой задачи.
\end{proof}
Задачи SMT и "целочисленное линейное неравенство" - обобщения задач SAT и
"булево линейное неравенство" соответственно, также являются NP-полными. Доказательство
принадлежности задачи линейного программирования классу $\mathbb{NP}$ является нетривиальным.
\subsection{Задача 3}
\label{sec:org3ae75c8}
Доказать, что задача проверки простоты числа принадлежит классу \(\textit{co-}\mathbb{NP}\).

\textbf{Задача 3-выполнимости}: задача КНФ дизъюнкций с ровно тремя слагаемыми. Эта задача
полиномиально сводится к задаче SAT, и поэтому принадлежит к классу \(\mathbb{NP}\).
