Optimization/optimization.tex
\subsection{Задача 4}
\label{sec:org00d79e5}
Разложить конъюкцию одной или двух переменных в произведение конъюкции трёх переменных.
\begin{Statement}
Задача 3-выполнимости NP-полна.
\end{Statement}
\begin{proof}
Сведём задачу выполнимости к задаче 3-выполнимости. Разложим все длинные конъюкции в
произведение концъюкций длины 3: если выполнена конъюкция
\begin{equation*}
y_1 \vee y_2 \vee \ldots \vee y_k,
\end{equation*}
то выполнено произведение:
\begin{equation*}
(y_1 \vee y_2 \vee u_1)(y_3 \vee \overline{u_1} \vee u_2)\ldots(y_{k - 1} \vee y_k \vee \overline{u_{k - 3}})
\end{equation*}
для некоторых $u_1, u_2, \ldots, u_{k - 3}$. При этом количество переменных увеличилось не более,
чем в два раза.
\end{proof}
\begin{Theorem}
$\forall \Pi \in \mathbb{NP} \exists \text{ ДМТ } A \text{, решающая } \Pi, \exists p(\cdot)
T_A(\cdot) \leq 2^{p(\cdot)}$
\end{Theorem}
\begin{proof}
Так как $\Pi \in \mathbb{NP}$, то $\exists \text{ НМТ } \hat{A}: \forall I \in Y(\Pi) \exists$
$s: |s| \leq p_1(|I|), z_{A_s} \leq p_2(|I|)$. Будем моделировать НМТ с помощью ДМТ,
каждому состоянию оригинальной НМТ отвечает множество состояний ДМТ. При переходе между
состояниями делаем переходы на каждой ДМТ, "входящей" в НМТ. Тогда
\begin{equation*}
t_A(\sigma) \leq p_2(|\sigma|)|\Sigma|^{p_1(\sigma)}
\end{equation*}
\end{proof}
Класс \textbf{NP-трудных} задач(\(\mathbb{NP}-hard\)) -- это:
\begin{enumerate}
\item задачи оптимизации, для которых соответствующая задача распознавания свойств NP-полна.
\item задачи распознавания свойств, для которых есть NP-полная задача, сводимая к ней, но принадлежность которой к классу \(\mathbb{NP}\) не доказана.
\item все задачи, к которым сводятся(по Тьюрингу) NP-трудные задачи(\(\Pi' \propto_T \Pi\)).
\end{enumerate}
Задача \(\Pi\) принадлежит классу \(PSPACE\), если её можно решить за полиномиальное количество
памяти на ДМТ. Все ранее рассмотренные классы входят в класс \(PSPACE\). Вопрос строгого
включения класса \(P\) в класс \(PSPACE\) остаётся открытым.
\subsection{Задача о рюкзаке}
\label{sec:org9614ebc}
Найти
\begin{equation}
max_{z \in B^n}\sum_{i = 1}^nc_iz_i,
\end{equation}
при том, что
\begin{equation}
\sum_{i = 1}^nw_iz_i \leq K
\end{equation}
Условия: $K, c_i, W_i, B \in \mathbb{N}$.
Эта задача сводится к задаче булева линейного программирования и является NP-полной.

Задача решается методом динамического программирования. Сложность решения $nKO(\log(c_i, w_i, K))$.
Если $K \sim p(n)$, то задача, тем не менее, решается полиномиально.

Введём \(num(I)\) -- максимальное по модулю целое число, фигурирующее в записи задачи \(I\). ДМТ
\(A\) решения задачи \(\Pi\) называется \textbf{псевдополиномиальным}, если
\(\exists p(\cdot, \cdot): \forall I \in \Pi T_A(I) \leq p(|I|, num(I))\).
\textbf{Полиномиальным сужением} задачи \(\Pi\) называется задача \(\Pi_{p(\cdot)} = \{I \in \Pi | num(I) \leq p(|I|)\}\).

Задача \(\Pi\) распознавания свойств называется \textbf{сильно-NP-полной, если} её полиномиальное сужение
NP-полно.
\begin{Theorem}
Если $\mathbb{P} \neq \mathbb{NP}$, то ни для какой сильно-NP-полной задачи нет псевдополиномиального
алгоритма её решения.
\end{Theorem}
\begin{proof}
Пусть для некоторой сильно-NP-полной задачи мы нашли псевдополиномиальное решение. Тогда
$\exists p(\cdot, \cdot): \exists A: t_A(I)O \leq p(|I|, num(I))$, соответственно,
$\forall I \in \Pi_{p(\cdot)}: T_A(I) \leq p(|I|, p(|I))$, поэтому $\Pi_{p(\cdot)} \in \mathbb{P}$,
откуда следует, что $\mathbb{P} = \mathbb{NP}$. Противоречие.
\end{proof}
\textbf{Задача оптимизации} -- найти значение и реализацию
\begin{equation}
Opt(I) = \max_{z \in S_I}f_I(z)
\end{equation}
\section{Задача оптимизации}
\label{sec:org4435611}
\zall
\(f_I(z)\) называется \textbf{целевой функцией}, значение функции называется \textbf{значением оптимума}, а
точка, в которой она достигается -- \textbf{реализацией оптимума}.
\(S_i \subset \mathbb{Z}^{n_I}\) -- \textbf{допустимая область}, \(f_I: S_I \rightarrow \mathbb{Z}\).

Алгоритм \(A\) называется \textbf{приближённым алгоритмом} решения задачи \(\Pi\) оптимизации, если
\(\forall I \in \Pi A(I) \text{ даёт } z^A(I) \in S_I\). Значение целевой функции в точке \(z^A(I)\)
называется \textbf{приближённым значением} и обозначается \(A_f(I)\).
\begin{Statement}
Если $\mathbb{P} \neq \mathbb{NP}$, то $\forall C \not\exists$ приближённого алгоритма $A$,
решающего задачу о рюкзаке с $T_a(\cdot) \leq p(\cdot)$ и $|A_f(I) - Opt(I)| < C$.
\end{Statement}
\begin{proof}
Пусть такой алгоритм существует. Построим по нему точный полиномиальный алгоритм решения
задачи о рюкзаке: от задачи $I$ перейдём к задаче $I'$ с полезностями $c'_i = c_i(C + 1)$.
Применив алгоритм $A$ на $I'$ и разделив ответ на $C + 1$, получим $A'_f(I)$. Тогда
$Opt(I') = (C + 1)Opt(I) \Rightarrow |Opt(I) - A'(I)| = |\frac{Opt(I') - A_f(I')}{C + 1}| \leq \frac{C}{C + 1}$
$\Rightarrow |Opt(I) - A'(I)| = 0 \Rightarrow A'$ -- точный алгоритм, являющийся при этом
полиномиальным, что входит в противоречие с $\mathbb{P} \neq \mathbb{NP}$.
\end{proof}
Приближённый алгоритм \(A\) решения задачи оптимизации \(\Pi\) называется \(\varepsilon\)-приближённым,
если \(\forall I \in \Pi: \Delta_A(I) = |\frac{Opt(I) - A_f(I)}{Opt(I)}| < \varepsilon\).
\begin{Statement}
Если $\mathbb{P} \neq \mathbb{NP}$, то $\forall \varepsilon > 0 \not\exists \varepsilon$-приближённого
полиномиального решения общей задачи коммивояжёра.
\end{Statement}
Если параметры задачи целые, то длина входа ограничена снизу числом $n$.
\textbf{Размерность} задачи - размер массива входных данных.

\textbf{Полностью полиномиальной приближённой схемой} решения задачи оптимизации $\Pi$ называется
$\{A_{\varepsilon}\}$, где $\forall \varepsilon > 0 \forall I A_{\varepsilon}$ приближённо решает
$I$ с $t_{A_{\varepsilon}}(I) \leq p(|I|, \frac1{\varepsilon})$ и $\Delta_A(I) \leq \varepsilon$.
Тогда $T_{A_{\varepsilon}}(w) \leq p(w, \frac1{\varepsilon})$.

\begin{Statement}
Если для задачи оптимизации выполнены условия:
\begin{enumerate}
\item Существует псевдополиномиальный алгоритм решения
\item $\forall I \in \Pi: |Opt(I)| \leq p_1(|I|, num(I))$ и $|num(I)| \leq p_2(|I|, Opt(I))$.
\item $\sigma$ разбивается на $\sigma_f$, кодирующую $f_I$, и $\sigma_S$, кодирующую $S_I$ и $\forall z \in S_I f_I(z)$ линейна по $\sigma_f$.
\end{enumerate}
то существует полностью полиномиальная приближённая схема решения задачи $\Pi$.
\end{Statement}
\begin{Statement}
Если для задачи оптимизации соответствующая ей задача распознавания свойств является сильно
$NP$-полной и $\exists p'(\cdot): |Opt(I)| \leq p'(num(I)) \forall I \in \Pi$, то если
$\mathbb{P} \neq \mathbb{NP} \not\exists$ полностью полиномиальной приближённой схемы решения
$\Pi$.
\end{Statement}
\begin{proof}
Пусть $\exists$ искомая схема $\{A_{\varepsilon}\}$. Тогда построим алгоритм $A': \forall I \in \Pi A'$
вызывает $A_{\varepsilon}$, где $\varepsilon = \frac1{p'(num(I)) + 1}$. Тогда
$|Opt(I) - A'_f(I)| \leq \varepsilon Opt(I) \leq \frac{Opt(I)}{p'(num(I)) + 1} \leq \frac{p'(num(I))}{p'(num(I)) + 1} < 1$
$\Rightarrow |Opt(I) - A'(I)| = 0$, т. е. $A'$ - точный алгоритм, являющийся псевдополиномиальный.
\end{proof}
