Optimization/optimization.tex
\section{Линейное программирование}
\label{sec:org8f126fe}
\subsection{Литература}
\label{sec:orga32e7e5}
\begin{enumerate}
\item Л. Г. Хачиян "Сложность задач ЛП".
\end{enumerate}

Задача \textbf{линейного программирования} -- решить систему неравенств:
\zall
\begin{equation}
\begin{cases}
a_{11}x_1 + a_{12}x_2 + \ldots + a_{1n}x_n \leq b_1, \\
a_{21}x_1 + a_{22}x_2 + \ldots + a_{2n}x_n \leq b_2, \\
\ldots, \\
a_{m1}x_1 + a_{m2}x_2 + \ldots + a_{mn}x_n \leq b_m,
\end{cases}
(Ax \leq B), a_{ij}, b_i \in \mathbb{Z}
\end{equation}
При условии, что нулевых строк нет.

С этой задачей связана задача \textbf{линейное неравенство} -- существует ли решение (1)?
Этой задаче соответствует \textbf{основная задача линейного программирования}: найти
\begin{equation}
\max_{Ax \leq b}(c, x) = \max_{Ax \leq B}\sum_{i = 1}^mc_ix_i
\end{equation}
В этой задаче $x \in \mathbb{R}^n$, а найти нужно (2).
Оказывается, что задачи ЛН и ЛП полиномиальны.

\textbf{Каноническая форма} задачи ЛП:
\begin{equation}
\max_{Ax = b, x \geq 0}(c, x)
\end{equation}
Ещё одна форма:
\begin{equation}
\max_{Ax \leq b, x \geq 0}(c, x)
\end{equation}
\subsection{Задача 5}
\label{sec:org1bc8b5a}
Свести (4) к (2).

Ограничения описывают некоторый многогранник(а точнее, полиэдр, поскольку эта фигура не
обязательно ограничена) в n-мерном пространстве. С точки зрения геометрии, нужно найти
наиболее удалённую от нуля гиперплоскость уровня, пересекающую полиэдр.

\begin{Statement}[Принцип граничных решений]
Если задача (2) имеет решения, то $\exists$ подматрица $A_M$ матрицы $A$ такая, что любое
решение $x^*: A_Mx^* = B_M$ является решением задачи (2), $|M| = n$.
\end{Statement}
На этом наблюдении основан метод \textbf{направленного перебора} или \textbf{симплекс-метод} (Фурье).
Решаем систему, находим угловые точки, от угловой точки переходим к точке максимального роста.
Вообще говоря, количество вершин экспоненциально, поэтому полиномиальную версию симплекс-метода
получить не удаётся.
\end{document}
